src/xdsbridge/xml-resources/axis2/META-INF/XDSBridge.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="XDSBridgeService"
   targetNamespace="http://schemas.hieos.vangent.com/xdsbridge"
   xmlns="http://schemas.xmlsoap.org/wsdl/"
   xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
   xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/"
   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl"
   xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy"
   xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
   xmlns:wsoma="http://schemas.xmlsoap.org/ws/2004/09/policy/optimizedmimeserialization"
   xmlns:tns="http://schemas.hieos.vangent.com/xdsbridge">

    <xsd:annotation>
        <xsd:documentation xml:lang="en">
            This is the WSDL for the HIEOS XDS.b Bridge Service that enables a
            document source to submit one or more documents to an XDS.b Repository.
        </xsd:documentation>
    </xsd:annotation>

    <types>
        <xsd:schema targetNamespace="http://schemas.hieos.vangent.com/xdsbridge">
            <xsd:include schemaLocation="XDSBridge.xsd" />
        </xsd:schema>
    </types>
   
    <message name="SubmitDocumentRequestMessage">
        <part name="body" element="tns:SubmitDocumentRequest"/>
    </message>
    <message name="SubmitDocumentResponseMessage">
        <part name="body" element="tns:SubmitDocumentResponse"/>
    </message>
 
    <portType name="XDSBridgePortType">
        <operation name="SubmitDocumentRequest">
            <input message="tns:SubmitDocumentRequestMessage"
            wsaw:Action="urn:hieos:xds:bridge:SubmitDocumentRequest"/>
            <output message="tns:SubmitDocumentResponseMessage"
            wsaw:Action="urn:hieos:xds:bridge:SubmitDocumentResponse"/>
        </operation>
    </portType>
   
    <binding name="XDSBridgeBindingSoap12" type="tns:XDSBridgePortType">
        <soap12:binding style="document"
         transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsp:PolicyReference URI="#XDSBridgeServicePolicy"/>
        <operation name="SubmitDocumentRequest">
            <soap12:operation soapAction="urn:hieos:xds:bridge:SubmitDocumentRequest"/>
            <input>
                <soap12:body use="literal"/>
            </input>
            <output>
                <soap12:body use="literal"/>
            </output>
        </operation>
    </binding>
 
    <service name="xdsbridge">
        <port name="XDSBridgeEndpoint" binding="tns:XDSBridgeBindingSoap12">
            <soap12:address location="http://localhost:8080/axis2/services/xdsbridge"/>
        </port>
    </service>

    <wsp:Policy wsu:Id="XDSBridgeServicePolicy">
        <wsp:ExactlyOne>
            <wsp:All>
                <wsoma:OptimizedMimeSerialization/>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
</definitions>
