src/xdsbridge/test-resources/messages/XDSBridge-Sample-Request-1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xdsb="http://schemas.hieos.vangent.com/xdsbridge">
   <soapenv:Header/>
   <soapenv:Body>
      <xdsb:SubmitDocumentRequest>
         <!--PatientId extension is optional-->
         <PatientId root="1234567890123456" extension=""/>
         <!--OrganizationId extension is optional-->
         <OrganizationId root="1234" extension=""/>
         <Documents>
            <!--1 or more repetitions of Document-->
            <Document>
               <!--Type codeSystemName and displayName are optional-->
               <Type code="51855-5" codeSystem="2.16.840.1.113883.6.1"
                    codeSystemName="LOINC" displayName="Shared Health Summary"/>
               <!-- Id is Optional-->
               <Id>uuid:2b9a1234-a0df-4bae-ac3f-ec17cb3a93d7</Id>
               <!--Replace Id is Optional-->
               <ReplaceId></ReplaceId>
               <Content>cid:827684597413</Content>
            </Document>
         </Documents>
      </xdsb:SubmitDocumentRequest>
   </soapenv:Body>
</soapenv:Envelope>